# CheckerSoften Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Checker..::..CheckerSoften Property
Checker Class See Also
---
The property labeled "Soften" from the "Checker" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string CheckerSoften { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CheckerSoften As String
	Get
```

Visual C++
---
```text
public:
static property String^ CheckerSoften {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 5".
# See Also
Checker Class
Autodesk.Revit.DB.Visual Namespace